cask_args appdir: '/Applications'

tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'universal-ctags/universal-ctags'
tap 'getantibody/tap'

#Fonts
cask 'font-ubuntu'
cask 'font-ubuntumono-nerd-font'

#Formulas
brew 'git'
brew 'python'
brew 'python3'
brew 'ag'
brew 'bash-completion'
brew 'clang-format'
brew 'cmake'
brew 'cscope'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'gnu-sed', args: ["with-default-names"]
brew 'imagemagick'
brew 'neovim'
brew 'the_silver_searcher'
brew 'tldr'
brew 'ruby'
brew 'tmux'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'valgrind'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'getantibody/tap/antibody'
brew 'node'
brew 'thefuck'
brew 'jrnl'
brew 'tree'
brew 'mas'
brew 'fzy'
brew 'ranger'
brew 'terminal-notifier'
brew 'tmuxinator-completion'

#Casks
cask 'cheatsheet'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'clipy'
cask 'firefox'
cask 'github'
cask 'iTerm2'
cask 'go2shell'
cask 'postman'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'the-unarchiver'

#Mac AppStore
mas "Xcode", id: 497799835
mas "GIPHY CAPTURE", id: 668208984
mas "Amphetamine", id: 937984704
mas 'Spark', id: 1176895641
